# SpaceLoadClass Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalLoadClassification..::..SpaceLoadClass Property
ElectricalLoadClassification Class See Also
---
The electrical load class associated with a space.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ElectricalLoadClassificationSpace SpaceLoadClass { get; set; }
```

Visual Basic
---
```text
Public Property SpaceLoadClass As ElectricalLoadClassificationSpace
	Get
	Set
```

Visual C++
---
```text
public:
property ElectricalLoadClassificationSpace SpaceLoadClass {
	ElectricalLoadClassificationSpace get ();
	void set (ElectricalLoadClassificationSpace value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
ElectricalLoadClassification Class
Autodesk.Revit.DB.Electrical Namespace